[
  {
    "title": "Policy & Technical Accounting",
    "excerpt": "Who we areAbout StripeStripe is a financial infrastructure platform for businesses.",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Policy%20%26%20Technical%20Accounting%20at%20Stripe&companyLogo=https://cdn-images.himalayas.app/2z3gkkofrizlvk45j9o01mop2yu5&buttonText=Apply%20now&category=Technical%20Accounting%20Manager&skills=US%20GAAP%2CRevenue%20Accounting%2CInternational%20Consolidations%2CFinancial%20Products%2CInternational%20Payments%2CContracts%2CInvesting%2CStock%20Based%20Compensation%2CEquity%2CBusiness%20Operations&companyUrl=stripe.com&countryString=United%20States%20only&countryCodes=US",
    "companyName": "Stripe",
    "companyLogo": "https://cdn-images.himalayas.app/2z3gkkofrizlvk45j9o01mop2yu5",
    "minSalary": null,
    "maxSalary": null,
    "seniority": ["Senior"],
    "locationRestrictions": ["United States"],
    "timezoneRestrictions": [-10, -9, -8, -7, -6, -5, 14],
    "categories": [
      "Technical-Accounting-Manager",
      "Finance-And-Accounting",
      "Policy-And-Communications-Manager"
    ],
    "parentCategories": [],
    "description": "<h3><strong>Who we are</strong></h3><h3><strong>About <a href=\"https://himalayas.app/companies/stripe\">Stripe</a></strong></h3><p><a href=\"https://himalayas.app/companies/stripe\">Stripe</a> is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use <a href=\"https://himalayas.app/companies/stripe\">Stripe</a> to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.</p><h3><strong>About the team</strong></h3><p>We are looking for an experienced Policy  Technical Accountant to help us analyze and account for our most complex projects and baseline our policies in accordance with US GAAP. This candidate will have meaningful experience evaluating accounting issues with a particular focus in areas such as revenue (a must), consolidations, financial instruments, foreign currency, leases, investments, stock-based compensation, debt/equity, business combinations.  This person will build and maintain our accounting policy documentation working cross-functionally within the Accounting organization. The ideal candidate will have both public accounting experience (National Office rotation strongly preferred) in tech and/or financial service industries as well as hand-on industry experience working for companies with a high volume of complex transactions and issues.</p><p>This position within the Controllership organization will assess, research, analyze and document our accounting policy considerations for <a href=\"https://himalayas.app/companies/stripe\">Stripe</a> transactions, accounting policy elections, the adoption of new reporting and accounting standards, as well as other matters where technical expertise is required, particularly with respect to new product/service scoping and rollout.  This position will work and advise cross-functional teams with a focus on collaborating with various business partners.</p><h3><strong>What you’ll do</strong></h3><h3><strong>Responsibilities</strong></h3><ul>\n<li>Be responsible for technical accounting assessment of all applicable matters. </li>\n<li>Create, maintain and support our accounting conclusions. </li>\n<li>Develop a deep understanding of the Company’s transactions and contracts with cross-functional teams.</li>\n<li>Ensure that the Controllership organization can operationalize accounting requirements. </li>\n<li>Implement processes to ensure any changes in our contracts or transactions are assessed for proper application of US GAAP.  </li>\n<li>Stay current with changes in accounting standard and industry practices.</li>\n</ul><h3><strong>Who you are</strong></h3><p>We’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.</p><h3><strong>Minimum requirements</strong></h3><ul>\n<li>A bachelor’s degree in Accounting, supported by 12-15 years work experience, preferably in the payments industry, financial services, tech or public accounting firm.</li>\n<li>Demonstrated technical expertise (specifically FASB standards and SEC regulations). </li>\n<li>Detail orientation with exceptional organizational, analytical and problem-solving abilities.</li>\n<li>Self-motivator and team player who brings a can-do approach.</li>\n<li>The flexibility to constantly learn and adapt in a fast-paced environment.</li>\n<li>CPA (or equivalent), required.</li>\n</ul><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692036608,
    "expiryDate": 1697220607,
    "applicationLink": "https://himalayas.app/companies/stripe/jobs/policy-technical-accounting-87179701",
    "guid": "https://himalayas.app/companies/stripe/jobs/policy-technical-accounting-87179701"
  },
  {
    "title": "Russian Translator",
    "excerpt": "As a trusted global transformation partner, Welocalize accelerates the global business journey by enabling brands and companies to reach, engage, and grow international audiences.",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Russian%20Translator%20at%20Welocalize&companyLogo=https://cdn-images.himalayas.app/jbf6zsd1gb15i13qsfjjgf5zwu7h&buttonText=Apply%20now&category=Translator&skills=Translation%2CLocalization%2CLinguistics%2CLanguage%20Fluency&companyUrl=welocalize.com&countryString=Romania%20only&countryCodes=RO",
    "companyName": "Welocalize",
    "companyLogo": "https://cdn-images.himalayas.app/jbf6zsd1gb15i13qsfjjgf5zwu7h",
    "minSalary": null,
    "maxSalary": null,
    "seniority": ["Entry-level"],
    "locationRestrictions": ["Romania"],
    "timezoneRestrictions": [2],
    "categories": [
      "Translator",
      "Technical-Translator",
      "Translation-Specialist",
      "Translation"
    ],
    "parentCategories": [],
    "description": "<div>As a trusted global transformation partner, <a href=\"https://himalayas.app/companies/welocalize\">Welocalize</a> accelerates the global business journey by enabling brands and companies to reach, engage, and grow international audiences. <a href=\"https://himalayas.app/companies/welocalize\">Welocalize</a> delivers multilingual content transformation services in translation, localization, and adaptation for over 250 languages with a growing network of over 77,000 in-country linguistic resources. Driving innovation in language services, <a href=\"https://himalayas.app/companies/welocalize\">Welocalize</a> delivers high-quality training data transformation solutions for NLP-enabled machine learning by blending technology and human intelligence to collect, annotate, and evaluate all content types. Our team works across locations in North America, Europe, and Asia serving our global clients in the markets that matter to them. <a href=\"http://www.welocalize.com\" class=\"postings-link\">www.welocalize.com</a>\n</div><div><i>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</i></div><h3>Main Purpose of the Role</h3><div>\n<a href=\"https://himalayas.app/companies/welocalize\">Welocalize</a> is looking for a Russian native speaker to perform translations from English into Russian from Russia, using various translation tools for our projects to translate various types of content, including marketing, help and UI. </div><h3>Essential duties and responsibilities</h3><ul>\n<li>Learning the tools associated with translation work;</li>\n<li>Precisely following the established translation process, e.g. always raising queries when there is a need to;</li>\n<li>Learning the style guide and overall client’s requirements, e.g. stylistic preferences;</li>\n<li>Keeping track of personal error statistics and work on the weak spots;</li>\n<li>Taking part in the internal trainings and the ones organized by the client;</li>\n<li>Participating in the error arbitration process;</li>\n<li>Meeting the productivity KPIs;</li>\n<li>Taking part in the internal quality meetings and the quality calls organized by the client for the whole team;</li>\n<li>Constantly analyzing own gaps and thinking of what assistance the senior members and the client can provide to help address those.</li>\n</ul><h3>Qualification and required skills</h3><ul>\n<li>University degree in Linguistics/Translation OR; </li>\n<li>University degree in other fields AND relevant translation experience; </li>\n<li>Fluent in English (both written and spoken, in a wide range of registers); </li>\n<li>Native fluency in Russian. </li>\n</ul><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692035906,
    "expiryDate": 1697219905,
    "applicationLink": "https://himalayas.app/companies/welocalize/jobs/russian-translator",
    "guid": "https://himalayas.app/companies/welocalize/jobs/russian-translator"
  },
  {
    "title": "Senior Legal Counsel",
    "excerpt": "About RemoteRemote is solving global remote organizations’ biggest challenge: employing anyone anywhere compliantly.",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Senior%20Legal%20Counsel%20at%20Remote&companyLogo=https://cdn-images.himalayas.app/02y7tpdl1w6yjl8jb3ytnakxcf33&buttonText=Apply%20now&category=Senior%20Counsel&skills=Legal%20Advice%2CContract%20Drafting%2CLitigation%20Management%2CContract%20Negotiation%2CGoogle%20Drive%2CKissflow&companyUrl=remote.com&countryString=Africa%20%26%20ZA&countryCodes=DZ%2CAO%2CBJ",
    "companyName": "Remote",
    "companyLogo": "https://cdn-images.himalayas.app/02y7tpdl1w6yjl8jb3ytnakxcf33",
    "minSalary": null,
    "maxSalary": null,
    "seniority": ["Senior", "Manager"],
    "locationRestrictions": [
      "Algeria",
      "Angola",
      "Benin",
      "Botswana",
      "British Indian Ocean Territory",
      "Burkina Faso",
      "Burundi",
      "Cabo Verde",
      "Cameroon",
      "Central African Republic",
      "Chad",
      "Comoros",
      "Congo",
      "Congo, The Democratic Republic of the",
      "Côte d'Ivoire",
      "Djibouti",
      "Egypt",
      "Equatorial Guinea",
      "Eritrea",
      "Eswatini",
      "Ethiopia",
      "French Southern Territories",
      "Gabon",
      "Gambia",
      "Ghana",
      "Guinea",
      "Guinea-Bissau",
      "Kenya",
      "Lesotho",
      "Liberia",
      "Libya",
      "Madagascar",
      "Malawi",
      "Mali",
      "Mauritania",
      "Mauritius",
      "Mayotte",
      "Morocco",
      "Mozambique",
      "Namibia",
      "Niger",
      "Nigeria",
      "Rwanda",
      "Réunion",
      "Saint Helena, Ascension and Tristan da Cunha",
      "Sao Tome and Principe",
      "Senegal",
      "Seychelles",
      "Sierra Leone",
      "Somalia",
      "South Africa",
      "South Sudan",
      "Sudan",
      "Tanzania",
      "Togo",
      "Tunisia",
      "Uganda",
      "Western Sahara",
      "Zambia",
      "Zimbabwe"
    ],
    "timezoneRestrictions": [-1, 0, 1, 2, 3, 4, 5, 6],
    "categories": [
      "Senior-Counsel",
      "Senior-Corporate-Counsel",
      "Sr.-Commercial-Counsel",
      "General-Counsel",
      "Lead-Commercial-Counsel",
      "Senior-Privacy-Security-Counsel",
      "Legal-Counsel",
      "HR-Legal-Counsel"
    ],
    "parentCategories": [],
    "description": "<div class=\"content-intro\">\n<h3><strong>About <a href=\"https://himalayas.app/companies/remote\">Remote</a></strong></h3>\n<p><a href=\"https://himalayas.app/companies/remote\">Remote</a> is solving global remote organizations’ biggest challenge: employing anyone anywhere compliantly. We make it possible for businesses big and small to employ a global team by handling global payroll, benefits, taxes, and compliance. Check out <a href=\"http://remote.com/how-it-works\">remote.com/how-it-works</a> to learn more or if you’re interested in adding to the mission, scroll down to apply now.</p>\n<p>Please take a look at <strong><a href=\"http://remote.com/handbook\">remote.com/handbook</a></strong> to learn more about our culture and what it is like to work here. <strong>Not only do we encourage folks from all ethnic groups, genders, sexuality, age and abilities to apply, but we prioritize a sense of <a href=\"https://www.notion.so/people-Belonging-Diversity-Equity-Inclusion-DEI-4990e36a7d7b4d52a78ca3efb23d718b\">belonging</a>.</strong> You can check out independent reviews by other candidates on <a href=\"https://www.glassdoor.com/Overview/Working-at-&lt;a%20href='https://himalayas.app/companies/remote'&gt;Remote&lt;/a&gt;-EI_IE3871683.11,17.htm\">Glassdoor</a> or look up the <a href=\"https://www.notion.so/people-Candidate-Experience-Surveys-17d595a88b7548148593792a8072235f\">results of our candidate surveys</a> to see how others feel about working and interviewing here.</p>\n<p><strong>All of our positions are fully remote. You do not have to relocate to join us!</strong></p>\n</div><h3>The position</h3><p>This is an exciting time to join <a href=\"https://himalayas.app/companies/remote\">Remote</a> and make a personal difference in the global HR-tech space as <strong>Senior Legal Counsel</strong>, joining our Legal Team. We are looking for a talented and eager lawyer, who is interested in helping with our team’s mission, namely: <em>supercharging our business through the provision of excellent legal advice and implementation of solid legal processes.</em></p><p><a href=\"https://himalayas.app/companies/remote\">Remote</a>’s well established Legal team is a bunch of friendly, talented highly motivated lawyers from a whole host of different countries, with some awesome experiences.</p><p>As <a href=\"https://himalayas.app/companies/remote\">Remote</a> is increasing its global footprint and adding new products to the web platform, every new venture brings a myriad legal issues. The Legal Team is responsible for the legal aspects of new products or services, the legal soundness of our business models, contractual agreements with clients and their staff (i.e. the employees we hire under our “Employer of Record” service – our “external employees”), and data protection compliance amongst other areas.</p><h3>More specifically, we support:</h3><ol>\n<li>Our Product and Engineering teams in creating, developing, and launching new products through the entire product lifecycle, including assisting or leading in: drafting terms, legal copy, efficacy of updates, trainings and SOPs, pricing, business risk, etc.</li>\n<li>Our Partnerships team in drafting revenue sharing contracts or referral programs;</li>\n<li>Our Legal team, including managing litigations (from document collection, to demand letters, to managing outside counsel in instituting a suit)</li>\n<li>Our Marketing team, including copy for promotions, advertisements, and other marketing materials;</li>\n<li>Our Finance team by leading vendor review, including legal review of terms, modification of agreements, and evaluation of GDPR compliance;</li>\n<li>Our Employee Lifecycle team in their support for external employees (from simple amendments, employer policies to disciplinary actions and terminations);</li>\n<li>Our International Expansion team, providing them with Legal support as we expand into new territories; and</li>\n<li>Our Sales team in their negotiations with clients (this includes negotiation, redlining, and tracking).</li>\n</ol><p>Our Legal team enjoy exposure to a broad range of areas, but are also encouraged to focus on one or two things specifically.  We want to empower team members to have the highest level of Care (one of our five core <a href=\"https://www.notion.so/d43475e8895c4b7c811490aef64782b3?pvs=21\">values</a>) for their projects and tasks.  They nevertheless have support, leadership and guidance from our legal management team and General Counsel who has run Legal teams in 2 fast-paced scale ups.</p><p>What we are most focusing on these days is:</p><ol>\n<li>Providing better support to key departments by providing efficient legal and other processes.</li>\n<li>A better internal knowledge base so that colleagues can quickly find the answers they need on a self-service basis.</li>\n<li>Collaborating cross-functionally to draft and negotiate strong commercial partnership agreements.</li>\n<li>Providing top quality Product counsel to teams that are improving our existing service and launching new services.</li>\n</ol><h3><strong>What this job can offer you</strong></h3><ul>\n<li>Advise Sales, Product, Operations, Customer Success, International Expansion and People teams on a wide range of legal issues across multiple jurisdictions.</li>\n<li>Manage litigation</li>\n<li>Create, negotiate and manage contracts at all levels (client facing documentation as well as employment contracts)</li>\n<li>Manage external local counsel (instructing, distilling advice, managing fees).</li>\n<li>Contribute to internal knowledge bases so that our colleagues can increasingly self-serve.</li>\n<li>Assist with other legal, advisory and compliance work as required.</li>\n</ul><h3><strong>What you bring</strong></h3><ul>\n<li>Qualified Lawyer (mandatory)</li>\n<li>Figures out solutions rather than just escalating problems.</li>\n<li>Low ego.</li>\n<li>Previous in-house experience (preferably 3 years+)</li>\n<li>Interested in working for a tech-scaleup and specifically HR-tech</li>\n<li>Excellent analytical and organizational skills</li>\n<li>Ability to switch between multiple different projects</li>\n<li>Ability to learn and master <a href=\"https://himalayas.app/companies/remote\">Remote</a>'s communication application (Slack), contract management system (Juro), documentation sources (Notion, Google Drive, etc.), and task management system (KissFlow)</li>\n<li>Eager to learn about different legal systems</li>\n<li>Writes and speaks fluent English</li>\n<li>It is not required to have experience working remotely, but considered a plus.</li>\n</ul><h3><strong>Practicals</strong></h3><ul>\n<li>\n<strong>You'll report to:</strong> Senior Managing Counsel; Legal Team</li>\n<li>\n<strong>Team:</strong> Legal</li>\n<li>\n<strong>Location</strong>: Anywhere in the World</li>\n<li>\n<strong>Start date</strong>: As soon as possible</li>\n</ul><h3><strong><a href=\"https://himalayas.app/companies/remote\">Remote</a> Compensation Philosophy</strong></h3><p><a href=\"https://himalayas.app/companies/remote\">Remote</a>'s <a class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"../../1945bce8d3924ece9421ba8630f57b0c?pvs=25\">Total Rewards philosophy</a> is to ensure fair, unbiased compensation and fair equity pay along with competitive benefits in all locations in which we operate. We do not agree to or encourage cheap-labor practices and therefore we ensure to pay above in-location rates. We hope to inspire other companies to support global talent-hiring and bring local wealth to developing countries.</p><h3><strong>Application process</strong></h3><ol>\n<li>(async) Profile review</li>\n<li>Interview with recruiter</li>\n<li>Interview with future manager</li>\n<li>Interview with member of the legal team (no managers present)</li>\n<li>Interview with Head of Legal </li>\n<li>\n<a href=\"https://www.notion.so/Veremark-&lt;a%20href='https://himalayas.app/companies/remote'&gt;Remote&lt;/a&gt;-96e108c037b8423cbd4c3f07a1f9b38b\">Prior employment verification check</a> (Read more at <a href=\"http://remote.com/employment-checks\">remote.com/employment-checks</a>)</li>\n<li>(async) Offer </li>\n</ol><div class=\"content-conclusion\">\n<h3><strong>Benefits</strong></h3>\n<div class=\"p-rich_text_section\">\n<div class=\"p-rich_text_section\">Our full benefits  perks are explained in our handbook at <a class=\"c-link\" href=\"http://remote.com/r/benefits\">remote.com/r/benefits</a>. As a global company, each country works differently, but some benefits/perks are for all <a href=\"https://himalayas.app/companies/remote\">Remote</a>rs:</div>\n<ul class=\"p-rich_text_list p-rich_text_list__bullet\">\n<li>work from anywhere</li>\n<li>unlimited personal time off (minimum 4 weeks)</li>\n<li>quarterly company-wide day off for self care</li>\n<li>flexible working hours (we are <a class=\"c-link\" href=\"https://www.notion.so/remotecom/Working-Async-at-&lt;a%20href='https://himalayas.app/companies/remote'&gt;Remote&lt;/a&gt;-80c01cd443ad4c77a8ceaef7c5fba5d0\">async</a>)</li>\n<li>16 weeks paid parental leave</li>\n<li>mental health support services</li>\n<li>stock options</li>\n<li>learning budget</li>\n<li>home office budget  IT equipment</li>\n<li>budget for local in-person social events or co-working spaces</li>\n</ul>\n</div>\n<h3><strong>How you’ll plan your day (and life)</strong></h3>\n<p>We work async at <a href=\"https://himalayas.app/companies/remote\">Remote</a> which means you can plan your schedule around your life (and not around meetings). Read more at <a href=\"http://www.remote.com/async\">remote.com/async</a>.</p>\n<p>You will be empowered to take ownership and be proactive. When in doubt you will default to action instead of waiting. Your <strong>life-work balance</strong> is important and you will be encouraged to put yourself and your family first, and fit work around your needs.</p>\n<p>If that sounds like something you want, apply now!</p>\n<h3><strong>How to apply</strong></h3>\n<ol>\n<li>Please fill out the form below and upload your CV with a PDF format.</li>\n<li><strong>We kindly ask you to submit your application and CV in English, as this is the standardised language we use here at <a href=\"https://himalayas.app/companies/remote\">Remote</a>.</strong></li>\n<li>If you don’t have an up to date CV but you are still interested in talking to us, please feel free to add a copy of your LinkedIn profile instead.</li>\n</ol>\n<p>We will ask you to voluntarily tell us your pronouns at interview stage, and you will have the option to answer our anonymous demographic questionnaire when you apply below. As an equal employment opportunity employer it’s important to us that our workforce reflects people of all backgrounds, identities, and experiences and this data will help us to stay accountable. We thank you for providing this data, if you chose to.</p>\n<p>Need help? Email <a class=\"c-link\" href=\"mailto:hiring@remote.com\">hiring@remote.com</a></p>\n</div><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692032167,
    "expiryDate": 1697216167,
    "applicationLink": "https://himalayas.app/companies/remote/jobs/senior-legal-counsel-9440193045",
    "guid": "https://himalayas.app/companies/remote/jobs/senior-legal-counsel-9440193045"
  },
  {
    "title": "Artificial Intelligence Scientist",
    "excerpt": "OverviewRarebase is an early-stage biotechnology public benefit corporation based in Palo Alto, California working to advance personalized medicine for the thousands of genetic diseases that have no effective treatments.",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Artificial%20Intelligence%20Scientist%20at%20Rarebase&companyLogo=https://cdn-images.himalayas.app/vfl5qowwps5t5mm5y5wmevgqv5nv&buttonText=Apply%20now&category=Artificial%20Intelligence%20Scientist&skills=AI%2CMachine%20Learning%2CPython%2CData%20Visualization%2CComputational%20Biology%2CAI%20Tools%2CBioinformatics%2CComputer%20Vision&companyUrl=rarebase.org&countryString=&countryCodes=",
    "companyName": "Rarebase",
    "companyLogo": "https://cdn-images.himalayas.app/vfl5qowwps5t5mm5y5wmevgqv5nv",
    "minSalary": null,
    "maxSalary": null,
    "seniority": ["Senior", "Manager"],
    "locationRestrictions": [],
    "timezoneRestrictions": [
      -11, -10, -9.5, -9, -8, -7, -6, -5, -4, -3.5, -3, -2, -1, 0, 1, 2, 3, 3.5,
      4, 4.5, 5, 5.5, 5.75, 6, 6.5, 7, 8, 8.75, 9, 9.5, 10, 10.5, 11, 12, 12.75,
      13, 14
    ],
    "categories": [
      "Artificial-Intelligence-Scientist",
      "Machine-Learning-Scientist",
      "Computer-Vision-Scientist",
      "AI-Researcher",
      "Staff-Machine-Learning-Engineer"
    ],
    "parentCategories": [],
    "description": "<h3>Overview</h3><p><a href=\"https://himalayas.app/companies/rarebase\">Rarebase</a> is an early-stage biotechnology public benefit corporation based in Palo Alto, California working to advance personalized medicine for the thousands of genetic diseases that have no effective treatments. We operate at the intersection of technology and biology, collaborating closely with patient communities to ensure that drug discovery and development is aligned with our shared goals - to bring effective treatments to the clinic as quickly and safely as possible.</p><p>Our Function™ drug and target discovery platform integrates cellular modeling of disease with functional genomics, high throughput screening, high content imaging and computational biology to identify molecules that address the underlying biology of genetic diseases. To support Function’s rapid growth, we are building a next-generation automated lab and are recruiting a San Francisco Bay Area-based scientific team to be intimately involved in its development.</p><p><a href=\"https://himalayas.app/companies/rarebase\">Rarebase</a> is backed by top-tier institutional investors, pharma and biotech angel investors, families personally affected by rare disease, and others that truly care about our mission to re-invent therapeutic development for genetic diseases. Our advisors are leaders in the biotech and genetic disease community.</p><h3>The Opportunity</h3><p>We’re looking for an Artificial Intelligence Scientist to lead the development of new AI systems to predict therapies for rare diseases, and assist in the design, execution and scale-up of an optimized experimental-computational platform identifying compounds for pediatric neurological disorders, among others.  </p><p>The ideal candidate will have experience with existing and emerging artificial intelligence algorithms and possess the skills to quickly develop approaches for new applications. </p><p>This individual in this role will work closely with the broader discovery team of computational biologists, data engineers and scientists to build and optimize the analysis and modeling pipeline to support our work. </p><p>As an early member of <a href=\"https://himalayas.app/companies/rarebase\">Rarebase</a>’s computational biology team, you will be joining a biotech startup that has long term stability but yet is very much in formation, providing many opportunities for significant growth and impact. You will also work alongside a multidisciplinary team and an outstanding team of scientists focused on conducting inventive and innovative science that will lead to the discovery of novel medicines. </p><h3>What you’ll do</h3><ul>\n<li><p>Apply your expertise with AI and machine learning to develop robust, validated predictive models of therapeutic response from diverse biological datasets</p></li>\n<li><p>Create novel pipelines and/or algorithms to identify optimal therapies</p></li>\n<li><p>Contribute creatively to the company’s strategy, helping drive new discovery for rare diseases</p></li>\n<li><p>Champion ideas for new approaches to prediction and process automation   </p></li>\n<li><p>Collaborate closely with the broader computational team including bioinformatics scientists, computer vision / image specialists, computational neuroscientists, and data engineers, and the science team (neuroscientists, high-throughput biologists, clinical design experts)</p></li>\n<li><p>Communicate data and scientific results to both internal and external audiences with a high degree of sophistication.</p></li>\n</ul><h3>What you’ll bring</h3><ul>\n<li><p>PhD in Computer Science, Data Science, Electrical Engineering, Computational Biology, Bioengineering, Systems Engineering, or related disciplines </p></li>\n<li><p>5+ years of hands-on experience working with AI methods in an industrial, clinical or academic setting</p></li>\n<li><p>Track record of developing and implementing novel AI algorithms </p></li>\n<li><p>Track record of handling mixed, very high-dimensional data types (e.g., time-series, images, sequencing data, continuous/categorical, meta-data)</p></li>\n<li><p>Track record of versatile programming experience and tool design </p></li>\n<li><p>Experience with life-long learning approaches</p></li>\n<li><p>Experience programming in Python and ability to quickly learn new languages and tools</p></li>\n<li><p>Knowledgeable about version control, code documentation and best practices</p></li>\n<li><p>Experience with Explainable AI (XAI), FAIR practices, and automating the design of test/training sets a plus</p></li>\n<li><p>Experience mining and integrating databases and developing data visualizations a plus</p></li>\n<li><p>Experience working in therapeutic discovery, rare diseases, developmental biology or neuroscience is a plus</p></li>\n<li><p>Excellent communication and interpersonal skills with an ability to work both independently and in a team environment</p></li>\n<li><p>A relentless drive and curiosity coupled with great resilience and adaptability </p></li>\n</ul><h3>What we offer</h3><ul>\n<li><p>An opportunity to work closely with a cutting-edge, interdisciplinary technology team and patient organizations on translational research</p></li>\n<li><h3>Premium health and dental insurance</h3></li>\n<li><p>Competitive salary and equity in a growing, well-funded startup</p></li>\n<li><h3>Generous vacation policy</h3></li>\n</ul><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692031159,
    "expiryDate": 1694623159,
    "applicationLink": "https://himalayas.app/companies/rarebase/jobs/artificial-intelligence-scientist-3002866351",
    "guid": "https://himalayas.app/companies/rarebase/jobs/artificial-intelligence-scientist-3002866351"
  },
  {
    "title": "Customer Success Manager - Philippines",
    "excerpt": "We are seeking an experienced remote Customer Success Manager from Asia to join our Success team.",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Customer%20Success%20Manager%20-%20Philippines%20at%20Hubstaff&companyLogo=https://cdn-images.himalayas.app/0jas8tsjkvq5otewyutjjv51u2cv&buttonText=Apply%20now&category=Customer%20Success%20Manager&skills=Customer%20Success%20Management%2CSaaS%20Products%2CProject%20Management%2CHubstaff%2C.NET&companyUrl=hubstaff.com&countryString=Philippines%20only&countryCodes=PH",
    "companyName": "Hubstaff",
    "companyLogo": "https://cdn-images.himalayas.app/0jas8tsjkvq5otewyutjjv51u2cv",
    "minSalary": 30000,
    "maxSalary": 33000,
    "seniority": ["Manager"],
    "locationRestrictions": ["Philippines"],
    "timezoneRestrictions": [8],
    "categories": [
      "Customer-Success-Manager",
      "Client-Success-Manager",
      "Manager-Of-SMB-Customer-Success",
      "Sr.-Manager-Of-Customer-Success",
      "Customer-Success-Executive",
      "Customer-Success"
    ],
    "parentCategories": [],
    "description": "<p>We are seeking an experienced remote Customer Success Manager from Asia to join our Success team. </p><p><em>Even though this is a fully remote position and due to the company's goals, we're explicitly hiring someone living in</em><em> the Philippines.</em></p><h3>What You’ll Do:</h3><ul>\n<li>Work closely with customers to ensure they are satisfied with <a href=\"https://himalayas.app/companies/hubstaff\">Hubstaff</a> from implementation and initial value to renewals and expansions (promoting retention and loyalty amongst the customer base). </li>\n<li>Grow net dollar retention rate for a portfolio of customers assigned to you.</li>\n<li>Discern opportunities for revenue growth and close cross-sell and upsell opportunities (independently or in partnership with Sales), and act upon possible problems before they turn into complaints.</li>\n<li>Conduct onboarding, training, and review call with customers through multiple customer journey stages.</li>\n<li>Interface closely with sales, product, and marketing teams to share client feedback, resolve escalations, deliver outstanding client experiences, and impact the evolution of <a href=\"https://himalayas.app/companies/hubstaff\">Hubstaff</a> as a product.</li>\n</ul><h3>Requirements</h3><ul>\n<li>+2 years experience in Customer Success Management working with a SaaS product and/or mid-market customers (mandatory).</li>\n<li>High-level proficiency in the English language, both written and verbal (mandatory).</li>\n<li>Product savvy - able to develop a strong understanding and technical knowledge in order to speak confidently to customers and communicate their needs to our team.</li>\n<li>Excellent project management skills and the ability to manage multiple initiatives with complex moving parts, competing priorities, and multiple levels of stakeholder management.</li>\n<li>Strong work ethic and a team player, empathetic, highly responsive, and energetic.</li>\n<li>Living in the Philippines.</li>\n</ul><h3>Benefits</h3><ul>\n<li>\n<a href=\"https://himalayas.app/companies/hubstaff\">Hubstaff</a> is a fast-growing time-tracking and project management startup that fully embraces remote work.</li>\n<li>Our team has people from 30 different countries: we value and welcome diverse backgrounds.</li>\n<li>We expect our professionals to work 40 hours/week and hope they can work with us for years to come.</li>\n<li>We are looking for someone in the European timezone for this particular position. </li>\n<li>Flexibility is essential to us, so <a href=\"https://himalayas.app/companies/hubstaff\">Hubstaff</a> offers this flexibility in your day-to-day but also about the contract type.</li>\n<li>Our professionals can be hired as contractors (payment/hour) or as employees in more than 25 countries (salaried and getting additional benefits like vacations, paid leaves as sick or maternity or paternity leave, equipment and training bonuses, and health insurance, among others).</li>\n<li>We get the whole team together on our Annual Retreats to have fun while traveling and getting to know each other! So while 2020 had us virtually meeting because of the pandemic, we met in Portugal (in 2019) and Mexico (in 2018), and we had our first in-person retreat after Covid-19 in the Dominican Republic (Feb 2022).</li>\n<li>Annual Base and Gross Salary: Between USD 30,000.00 and USD 33,000.00 + Monthly Commissions (based on performance and monthly goals).</li>\n</ul><p>Curious? You can find more<a href=\"https://hubstaff.com/about\" class=\"external\"> about </a><a href=\"https://himalayas.app/companies/hubstaff\">Hubstaff</a> and what it's like working with us<a href=\"https://hubstaff.wistia.com/medias/tgs5i92fik\" class=\"external\"> here</a>. In addition, you can read more about us on our website and learn more about our history and work philosophy on our<a href=\"https://blog.hubstaff.com/remote/\" class=\"external\"> blog</a>.</p><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692030995,
    "expiryDate": 1697214995,
    "applicationLink": "https://himalayas.app/companies/hubstaff/jobs/customer-success-manager-philippines",
    "guid": "https://himalayas.app/companies/hubstaff/jobs/customer-success-manager-philippines"
  },
  {
    "title": "Senior Technologist, Education",
    "excerpt": "The worldwide data management software market is massive (IDC forecasts it to be $137.",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Senior%20Technologist%2C%20Education%20at%20MongoDB&companyLogo=https://cdn-images.himalayas.app/94qdkimpv65lpeocec3lxz7qmii9&buttonText=Apply%20now&category=Senior%20Training%20Specialist&skills=MongoDB%2CPython%2CNode.Js%2CJava%2CLinux%2CAWS&companyUrl=mongodb.com&countryString=North%20America%20only&countryCodes=AI%2CAG%2CAW",
    "companyName": "MongoDB",
    "companyLogo": "https://cdn-images.himalayas.app/94qdkimpv65lpeocec3lxz7qmii9",
    "minSalary": null,
    "maxSalary": null,
    "seniority": ["Senior"],
    "locationRestrictions": [
      "Anguilla",
      "Antigua and Barbuda",
      "Aruba",
      "Bahamas",
      "Barbados",
      "Belize",
      "Bermuda",
      "Bonaire, Sint Eustatius and Saba",
      "Canada",
      "Cayman Islands",
      "Costa Rica",
      "Cuba",
      "Curaçao",
      "Dominica",
      "Dominican Republic",
      "El Salvador",
      "Greenland",
      "Grenada",
      "Guadeloupe",
      "Guatemala",
      "Haiti",
      "Honduras",
      "Jamaica",
      "Martinique",
      "Mexico",
      "Montserrat",
      "Nicaragua",
      "Panama",
      "Puerto Rico",
      "Saint Barthélemy",
      "Saint Kitts and Nevis",
      "Saint Lucia",
      "Saint Martin (French part)",
      "Saint Pierre and Miquelon",
      "Saint Vincent and the Grenadines",
      "Sint Maarten (Dutch part)",
      "Trinidad and Tobago",
      "Turks and Caicos Islands",
      "United States",
      "Virgin Islands, British",
      "Virgin Islands, U.S."
    ],
    "timezoneRestrictions": [-10, -9, -8, -7, -6, -5, -4, -3.5, -3, -1, 0, 14],
    "categories": [
      "Senior-Training-Specialist",
      "Training-and-Education-Specialist",
      "Education-Specialist",
      "Technical-Trainer",
      "Senior-IT-Engineer"
    ],
    "parentCategories": [],
    "description": "<p>The worldwide data management software market is massive (IDC forecasts it to be $137.6 billion by 2026!). At <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> we are transforming industries and empowering developers to build amazing apps that people use every day. We are the leading modern data platform and the first database provider to IPO in over 20 years. Join our team and be at the forefront of innovation and creativity.</p><p>As a Senior Technologist, you'll work with a team of creative educators and software engineers dedicated to building the future of online technical education, developing courses for<a href=\"https://university.mongodb.com/\"></a><a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> University. </p><p><a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> University is the online training department of <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> and is chartered with building high quality training at a basic and advanced level across the entire <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> product stack. </p><p>Your work will directly impact the learning experience of millions of developers around the world, helping them become experts in the field by honing their skills on the fastest growing modern database. </p><h3>What You’ll Do</h3><p>You’ll work closely with a team of curriculum engineers, curriculum designers, and in-house subject-matter experts to build course materials ranging from labs to lessons, ensuring these <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> learning resources are relevant, interactive, and reflect the challenges developers encounter in the real world. </p><p>In this role, we expect you to serve as a <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> Subject Matter Expert (SME) ie. someone who knows a subset of <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> offerings in-depth.  You are not expected to know every product as we are building a SME team where different team members specialize in different areas of <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> including features for Developers, DBAs, Mobile and other key personas. </p><p>You will be expected to help articulate the key concepts that need to be covered in a training course, design the hands-on exercises and also be an expert to drive the creation of certification exams. If you are a current Developer or a current Administrator of <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a>, you will be able to add a lot of value to the team as we strive for our training to be from experts who already use our products. If you currently provide technical assistance or consulting for <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> solutions, you will also be able to add value to this team. </p><p>In this team, you will also get access to experts throughout the company and stay cutting edge on your technical skills and expertise. <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> continues to evolve and you will have the opportunity to explore new technology areas that will end up being represented as training offerings to train millions of developers in the future. </p><h3>Your core responsibilities and duties will include the following</h3><ul>\n<li>Be a designated expert on part of the <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> product set to help drive content strategy and direction along with our Product Strategy team</li>\n<li>Review content created by other team members for technical accuracy</li>\n<li>Develop course materials with existing templates and support from curriculum designers</li>\n<li>Develop hands-on lab exercises to help learners experience <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> technologies</li>\n<li>Collaborate with in-house subject-matter experts, curriculum designers, video producers, and product and marketing managers to develop a course from discovery to launch</li>\n<li>Opportunity to optionally represent <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> at public events such as webinars and conferences as training is featured prominently at <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> events</li>\n</ul><h3>What You’ll Need</h3><p>You’re a good fit for this role if you have a demonstrable track record in working with <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> already as a developer, DBA or some other capacity with a minimum of 4-5 years industry experience.  Your track record is more important than a Computer Science or similar degree. We expect you to be able to write and review content and code. As a Subject Matter Expert (SME), we are counting on your experience to translate technical concepts to help others learn <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a>.</p><h3>What this is not</h3><p>A development role. Some prototyping is required however the emphasis is on existing subject matter expertise and content development.</p><h3>You’ll be successful in this role if your qualifications and skills match the following</h3><ul>\n<li>Proven track record in working with <a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a>\n</li>\n<li>Proficiency in at least one contemporary programming language (Python, Node.js, Java, etc.)</li>\n<li>System administration experience in Linux</li>\n<li>Some cloud experience preferably with AWS</li>\n<li>Mentoring and upskilling a team</li>\n</ul><p>This role can be based anywhere in North America. </p><p>To drive the personal growth and business impact of our employees, we’re committed to developing a supportive and enriching culture for everyone. From employee affinity groups, to fertility assistance and a generous parental leave policy, we value our employees’ wellbeing and want to support them along every step of their professional and personal journeys.<a href=\"https://www.mongodb.com/blog/channel/culture\"> Learn more about what it’s like to work at </a><a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a>, and help us make an impact on the world!</p><p><a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a> is committed to providing any necessary accommodations for individuals with disabilities within our application and interview process. To request an accommodation due to a disability, please inform your recruiter.</p><p><a href=\"https://himalayas.app/companies/mongodb\">MongoDB</a>, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type and makes all hiring decisions without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</p><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692028923,
    "expiryDate": 1697212923,
    "applicationLink": "https://himalayas.app/companies/mongodb/jobs/senior-technologist-education-5357776582",
    "guid": "https://himalayas.app/companies/mongodb/jobs/senior-technologist-education-5357776582"
  },
  {
    "title": "Head of Performance Marketing",
    "excerpt": "🚀 WhatnotWhatnot is a livestream shopping platform and marketplace backed by Andreessen Horowitz, Y Combinator, and CapitalG.",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Head%20of%20Performance%20Marketing%20at%20Whatnot&companyLogo=https://cdn-images.himalayas.app/18xoc7rww1qwnzf9i3m1ftfnlmye&buttonText=Apply%20now&category=Director%20of%20Performance%20Marketing&skills=Performance%20Marketing%2CCampaign%20Management%2CTeam%20Management&companyUrl=whatnot.com&countryString=&countryCodes=",
    "companyName": "Whatnot",
    "companyLogo": "https://cdn-images.himalayas.app/18xoc7rww1qwnzf9i3m1ftfnlmye",
    "minSalary": null,
    "maxSalary": null,
    "seniority": ["Senior", "Manager"],
    "locationRestrictions": [],
    "timezoneRestrictions": [
      -11, -10, -9.5, -9, -8, -7, -6, -5, -4, -3.5, -3, -2, -1, 0, 1, 2, 3, 3.5,
      4, 4.5, 5, 5.5, 5.75, 6, 6.5, 7, 8, 8.75, 9, 9.5, 10, 10.5, 11, 12, 12.75,
      13, 14
    ],
    "categories": [
      "Director-of-Performance-Marketing",
      "Head-of-Marketing",
      "Head-of-Sales-and-Marketing",
      "Performance-Marketer",
      "Performance-Marketing-Specialist",
      "Director-Of-Growth-Marketing"
    ],
    "parentCategories": [],
    "description": "<h3>🚀 <a href=\"https://himalayas.app/companies/whatnot\">Whatnot</a>\n</h3><p><a href=\"https://himalayas.app/companies/whatnot\">Whatnot</a> is a livestream shopping platform and marketplace backed by Andreessen Horowitz, Y Combinator, and CapitalG. We’re building the future of ecommerce, bringing together community, shopping and entertainment. We are committed to our <a class=\"ql-link\" href=\"https://www.whatnot.com/careers\">values</a>, whether working remotely or from one of our offices. We are building a team that has experience from top tech, retail and payments platforms in the world.</p><p>We’re innovating in the fast-paced world of live auctions in categories including sports, fashion, video games, and streetwear. The platform couples rigorous seller vetting with a focus on community to create a welcoming space for buyers and sellers to share their passions with others.</p><p>And, we’re growing. <a href=\"https://himalayas.app/companies/whatnot\">Whatnot</a> has been the <a class=\"ql-link\" href=\"https://a16z.com/marketplace-100/\">fastest growing marketplace</a> in the US over the past two years and we’re hiring forward-thinking problem solvers across all functional areas.</p><h3>📈 Opportunity Size</h3><p>Retail disruption is one of the largest opportunities in the startup space today. Livestream shopping is taking off around the world – a $300B GMV market in China that’s grown 100% YoY. <a href=\"https://himalayas.app/companies/whatnot\">Whatnot</a> is bringing it to the world through a community-first approach, starting in the U.S. where retail is a $5T market opportunity!</p><h3>💻 Role</h3><p>As our Head of Performance Marketing, you will lead a team to scale a critical capability for the company’s growth. Reporting directly to the CEO, you’ll manage a team of marketers and campaign managers to drive the success and effectiveness of our performance marketing online media properties and beyond. You’ll need to deeply understand customer personas, creative that resonates with them as well as every metric that drives campaign performance. </p><h3>👋 You</h3><p>Curious about who thrives at <a href=\"https://himalayas.app/companies/whatnot\">Whatnot</a>? We’ve found that low ego, a growth mindset, and leaning into action and high impact goes a long way here.</p><ul>\n<li>10+ years of work experience with at least 3 years spent running large performance marketing campaigns</li>\n<li>World-class judge of talent and incredible team builder. You have previous experience building and scaling a world-class performance marketing team up to $10M+/mo in spend with strong payback periods</li>\n<li>Can help a team effectively deliver world-class creative that resonates with an audience while having a command of every key metric to drive business performance</li>\n<li>Know the entire performance marketing landscape, and have a perspective on how to build world-class campaigns in today’s changing landscape – this includes knowledge of the tools to use, running effective campaigns, the metrics to measure, and the proper attribution methodologies</li>\n<li>You will partner cross-functionally with our data, finance, engineering, and marketing teams to drive campaign success</li>\n<li>Can roll up your sleeves, to run any campaign yourself even if you haven’t done this fully for a period of time</li>\n</ul><h3>🎁 Benefits</h3><ul><li><ul>\n<li>Competitive base salary and stock options</li>\n<li>Unlimited Vacation Policy and Company-wide Holidays (including a spring and winter break)</li>\n<li>Health Insurance options including Medical, Dental, Vision, Life, Short term disability  Long term Disability<ul>\n<li>\n<a href=\"https://himalayas.app/companies/whatnot\">Whatnot</a> covers 99% of employee premium costs, and 75% of dependent care premiums for Medical</li>\n<li>Dental and Vision sponsored 100% by <a href=\"https://himalayas.app/companies/whatnot\">Whatnot</a> for employees and dependents</li>\n</ul>\n</li>\n<li>Work From Home Support<ul>\n<li>Laptop provided by <a href=\"https://himalayas.app/companies/whatnot\">Whatnot</a> and home office setup allowance</li>\n<li>$450 work-from-anywhere quarterly allowance for cell phone and internet</li>\n</ul>\n</li>\n<li>Care benefits<ul>\n<li>$1,350 quarterly allowance on food</li>\n<li>$1,500 quarterly allowance for wellness</li>\n<li>16 weeks Paid Parental Leave and gradual return to work</li>\n<li>$5,000 annual allowance towards Childcare</li>\n<li>$20,000 lifetime benefit for family planning, such as adoption or fertility expenses</li>\n</ul>\n</li>\n<li>Professional Development<ul><li>$2,000 annual benefit to invest in your professional development</li></ul>\n</li>\n<li>401k offering for Traditional and Roth accounts provided by Betterment<ul><li>Employer matching contributions of 100% of up to 4% of contributions on base salary</li></ul>\n</li>\n</ul></li></ul><h3>💛 EOE</h3><p><a href=\"https://himalayas.app/companies/whatnot\">Whatnot</a> is proud to be an Equal Opportunity Employer. We value diversity, and we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, parental status, disability status, or any other status protected by local law. We believe that our work is better and our company culture is improved when we encourage, support, and respect the different skills and experiences represented within our workforce.</p><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692028703,
    "expiryDate": 1697212703,
    "applicationLink": "https://himalayas.app/companies/whatnot/jobs/head-of-performance-marketing-3839498956",
    "guid": "https://himalayas.app/companies/whatnot/jobs/head-of-performance-marketing-3839498956"
  },
  {
    "title": "Senior Platform Engineer",
    "excerpt": "About MuxMux is video for developers.  Our mission is to democratize video by solving the hard problems developers face when building video: video encoding and streaming (Mux Video), video monitoring (Mux Data), and more.",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Senior%20Platform%20Engineer%20at%20Mux&companyLogo=https://cdn-images.himalayas.app/h5pgor3na7y6eccc1993lhw1yljn&buttonText=Apply%20now&category=Senior%20ML%20Platform%20Engineer&skills=Kubernetes%2CPlatform%20Engineering%2CLinux%2CGo%2CPrometheus%2CGrafana%2CElasticsearch%2COpenTelemetry%2CBazel%2CClickhouse&companyUrl=mux.com&countryString=United%20States%20only&countryCodes=US",
    "companyName": "Mux",
    "companyLogo": "https://cdn-images.himalayas.app/h5pgor3na7y6eccc1993lhw1yljn",
    "minSalary": 190000,
    "maxSalary": 220000,
    "seniority": ["Senior"],
    "locationRestrictions": ["United States"],
    "timezoneRestrictions": [-10, -9, -8, -7, -6, -5, 14],
    "categories": [
      "Senior-ML-Platform-Engineer",
      "Senior-Engineer",
      "Platform-Engineer",
      "Senior-Data-Platform-Engineer",
      "Senior-Technical-Support-Engineer"
    ],
    "parentCategories": [],
    "description": "<div>\n<h3>About <a href=\"https://himalayas.app/companies/mux\">Mux</a>\n</h3>\n<p><a href=\"https://himalayas.app/companies/mux\">Mux</a> is video for developers. Our mission is to democratize video by solving the hard problems developers face when building video: video encoding and streaming (<a href=\"https://himalayas.app/companies/mux\">Mux</a> Video), video monitoring (<a href=\"https://himalayas.app/companies/mux\">Mux</a> Data), and more. Video is a huge part of people’s lives, and we want to help make it better.</p>\n<p>We’re committed to building a healthy team that welcomes a diverse range of backgrounds and experiences. We want people who care about our mission, are ready to grow, believe in our values (from Be Human to Turn Customers Into Fans), and want to make the people around them better.</p>\n<p>You’ll be joining a <a href=\"https://mux.com/team/\">tight-knit team</a> with experience at places like Google, YouTube, Twitch, Zencoder, Fastly, and more. Our founders previously started (and sold) Zencoder, an early leader in cloud video technology, and authored Video.js, the biggest HTML5 video player on the web. We organize <a href=\"https://demuxed.com/\">Demuxed</a>, the premiere conference for video engineers in the world. </p>\n<p>We’re backed by top investors like Coatue, Accel, Andreessen Horowitz, and Y Combinator. You’ll get to work with amazing companies: hundreds of startups, plus Reddit, Vimeo, Robinhood, CBSi, Discovery, PBS, and TED. Customers large and small love working with us and love our team.</p>\n<p>We are building something big together. We’d love to hear from you!</p>\n<h3>About the Role</h3>\n</div><p>As a Senior Platform Engineer at <a href=\"https://himalayas.app/companies/mux\">Mux</a>, you will be a contributor to the design and operation of the infrastructure that powers <a href=\"https://himalayas.app/companies/mux\">Mux</a>’s high traffic, distributed platforms. Our Platform Engineering team works cross-functionally to ensure that services are scalable, reliable and easy to consume and operate. We invest in infrastructure, automation and tooling that reduces friction for engineers to develop and manage our products.</p><p>We’re looking for a Senior Platform Engineer who will enjoy the fast-paced nature of a startup, and has a strong record of building internal tooling and operating services through partnerships with product engineering teams. If you have a passion for Kubernetes, automation, learning, challenging and bettering your peers, you are a good fit for our team!</p><p><strong>What You'll Do</strong></p><ul>\n<li>Participate in the design and deployment of major shared infrastructure components to meet the growing demands of the distributed systems powering our products</li>\n<li>Build tooling and automation to support and increase the accessibility of our platform services augmenting the velocity of our product engineering teams</li>\n<li>Debug production issues across applications and services at all layers of the infrastructure stack</li>\n<li>Partner with engineering teams to build new features at scale while improving internal engineering standards, tooling, and processes</li>\n<li>Champion best practices for availability, reliability, capacity planning, incident management, and production readiness</li>\n<li>Participate in roadmap planning and prioritization</li>\n</ul><h3>Who You Are</h3><ul>\n<li>Experience building and scaling business-critical Kubernetes infrastructure through all phases of the cluster lifecycle</li>\n<li>Strong software engineering skills (experience with Go or multiple languages a bonus)</li>\n<li>Knowledge of engineering fundamentals such as TCP/UDP, HTTP, TLS, DNS, and Linux system administration</li>\n<li>Ability to mature our platforms through abstraction, automation, and iteration to create a seamless user experience for our development teams</li>\n<li>Maintaining healthy, respectful relationships within your team and across organizations</li>\n<li>Building and evolving CI/CD tools and pipelines (Bazel, Terraform on AWS and/or GCP, Argo CD/Workflows/Rollouts</li>\n<li>Implementing and utilizing infrastructure observability and monitoring tools (Prometheus, Grafana, Elasticsearch, OpenTelemetry)</li>\n<li>Hashicorp Vault and Secrets Management experience</li>\n</ul><h3>Nice to have:</h3><ul><li><ul>\n<li>Video technology experience (ingest, live-streaming, RTMP routing, content delivery, global networking)</li>\n<li>Event streaming platforms or data pipelines (Apache Kafka)</li>\n<li>Distributed databases (CockroachDB, ClickHouse)</li>\n<li>Experience with ingress and Service Meshes (Envoy, Cilium or similar)</li>\n</ul></li></ul><p>The starting base pay for this role is between $190,000 and $220,000. Actual pay may be dependent upon many factors, such as location, education, experience, skills, and internal equity. </p><p>In addition, we offer a variety of benefits to employees that may include merit increases, equity, home office stipends, paid holidays, unlimited PTO, medical, dental, vision, short and long-term disability benefits, and life insurance, among others.</p><p><em>If you don't have all of these requirements but think your experience could be a great fit, that's okay! Please apply and we can talk about what's most needed in the role.</em></p><h3>U.S. Benefits</h3><p>You'd join an amazing team from places like Google/YouTube, Amazon/Twitch, Facebook/Oculus, Brightcove, Bain, and the BBC. We have a supportive culture that cares about both excellent work and work-life balance.</p><p>We are <a class=\"notion-link-token notion-enable-hover\" href=\"https://mux.com/blog/remote-at-mux/\">remote-equal</a>, with an office space in Downtown San Francisco and London. </p><ul>\n<li>Flexible PTO with 2-week minimum + 11 company holidays</li>\n<li>Weekly no-meeting days + quarterly focus weeks</li>\n<li>Healthy work-life balance encouraged</li>\n<li>Competitive health, dental, and vision insurance (99% employee and 60% dependent premium coverage)</li>\n<li>Fertility benefits</li>\n<li>Flexible spending accounts for healthcare, dependent care, and commuter benefits</li>\n<li>Short-term and long-term disability insurance</li>\n<li>Group life insurance</li>\n<li>Critical illness  accident insurance</li>\n<li>Travel accident insurance</li>\n<li>Employee Assistance Program (EAP)</li>\n<li>Medical support concierge service</li>\n<li>401(k)</li>\n<li>Paid parental leave</li>\n<li>Investment in career growth and training</li>\n<li>Continued education stipend</li>\n<li>Thought leadership and peer recognition program</li>\n<li>Reimbursements for headphones, cell phones, device upgrades, and SVoD services of <a href=\"https://himalayas.app/companies/mux\">Mux</a> customers</li>\n<li>Lunch reimbursement program</li>\n</ul><p><a href=\"https://himalayas.app/companies/mux\">Mux</a> is an Equal Opportunity employer committed to building a diverse company. We believe diversity makes us better, and we strive to be inclusive and equitable. That’s why we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status.</p><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692028349,
    "expiryDate": 1697212348,
    "applicationLink": "https://himalayas.app/companies/mux/jobs/senior-platform-engineer-3854762555",
    "guid": "https://himalayas.app/companies/mux/jobs/senior-platform-engineer-3854762555"
  },
  {
    "title": "Data Scientist, Liquidity Management",
    "excerpt": "Who we areAbout StripeStripe is a financial infrastructure platform for businesses.",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Data%20Scientist%2C%20Liquidity%20Management%20at%20Stripe&companyLogo=https://cdn-images.himalayas.app/2z3gkkofrizlvk45j9o01mop2yu5&buttonText=Apply%20now&category=Data%20Scientist&skills=SQL%2CR%2CPython%2CMatlab%2CC%2B%2B%2CStatistical%20Modeling%2CCash%20Flow%20Management%2CFinancial%20Modeling%2CExperiment%20Design%2CData%20Analytics&companyUrl=stripe.com&countryString=CA%20%26%20US&countryCodes=CA%2CUS",
    "companyName": "Stripe",
    "companyLogo": "https://cdn-images.himalayas.app/2z3gkkofrizlvk45j9o01mop2yu5",
    "minSalary": null,
    "maxSalary": null,
    "seniority": ["Senior", "Manager"],
    "locationRestrictions": ["Canada", "United States"],
    "timezoneRestrictions": [-10, -9, -8, -7, -6, -5, -4, -3.5, 14],
    "categories": [
      "Data-Scientist",
      "Data-Science-Analyst",
      "Product-Insights-Data-Scientist",
      "Finance"
    ],
    "parentCategories": [],
    "description": "<div class=\"ace-line gutter-author-p-118095 emptyGutter\">\n<h3>Who we are</h3>\n<h3>About <a href=\"https://himalayas.app/companies/stripe\">Stripe</a>\n</h3>\n<p><a href=\"https://himalayas.app/companies/stripe\">Stripe</a> is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use <a href=\"https://himalayas.app/companies/stripe\">Stripe</a> to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.</p>\n<h3>About the team</h3>\n<p>We’re working on making the global financial system programmable. This is one of the largest opportunities for impact in the history of computing, on par with the rise of modern operating systems. Enabling the realization of this opportunity and simultaneously ensuring we optimally manage the liquidity flows from global payment processing and corporate activities, the Liquidity Management team plays a critical role in the company’s financial health.</p>\n<h3>What you’ll do</h3>\n<p>We're looking for an experienced Data Scientist to partner with the Liquidity Management team to drive the use of data and modeling to ensure money is in the right place, at the right time and in the right currency. You will help us to build predictive capabilities for user balance and corporate cash flows, develop stress testing models for quantifying liquidity risk and conduct analyses to inform our financial resource needs and business decisions. In doing so, you will work closely with the Liquidity Management, Engineering and Product teams to unlock new product capabilities and implement strategies for reducing costs and increasing capital efficiency.</p>\n<h3>Responsibilities</h3>\n<ul>\n<li>Analyze trends in user level liquidity requirements and corporate cash movements and develop data-driven recommendations to inform business decisions </li>\n<li>Design and develop stress testing models over different time horizons and equip business stakeholders with insights into drivers of liquidity risk</li>\n<li>Build automated controls and reporting on cash inflows and outflows in the <a href=\"https://himalayas.app/companies/stripe\">Stripe</a> ecosystem</li>\n<li>Build scalable automation solutions utilizing SQL, Spark, and visualization tools</li>\n<li>Develop statistical and machine learning models to forecast regional liquidity flows related to user balance and corporate cash activities</li>\n<li>Work cross-functionally to unblock and fund new product capabilities</li>\n<li>Collaborate with Engineering teams to ensure that our liquidity management systems are appropriate for the scale and complexity of our business</li>\n<li>Utilize optimization and simulation methods to develop strategies for reducing costs and increasing capital efficiency in managing volume flows in <a href=\"https://himalayas.app/companies/stripe\">Stripe</a>’s ecosystem</li>\n<li>Shape and influence our data models and instrumentation to generate insights and develop new data products and models</li>\n<li>Work with Product, Engineering and Finance teams to analyze new product opportunities and inform product design and financing requirements</li>\n</ul>\n<h3><strong>Who you are</strong></h3>\n<p>The ideal candidate has experience in analytics and statistical modeling for Liquidity Management, thinks creatively about measurement that leads to actionable outcomes, and values rigor in data and modeling.</p>\n<h3>Minimum requirements</h3>\n<ul>\n<li>5+ years of data science/quantitative modeling experience, including 3+ years experience analyzing large data sets in the financial sector </li>\n<li>A PhD or MS in a quantitative field (e.g., Quantitative Finance, Economics, Mathematics, Sciences, Engineering, Operations Research, Statistics)</li>\n<li>Strong working knowledge of SQL, R, Python, Matlab, C++, or equivalent.</li>\n<li>Strong understanding of financial industry models and liquidity management systems</li>\n<li>Expertise in statistics and experimental design</li>\n</ul>\n<h3><strong>Preferred qualifications</strong></h3>\n<ul>\n<li>Solid business acumen and experience in synthesizing complex analyses into interpretable content</li>\n<li>Expertise in statistics and experimental design</li>\n<li>A demonstrated ability to manage and deliver on multiple projects with a high attention to detail</li>\n<li>Ability to communicate results clearly and a focus on driving impact</li>\n<li>A builder's mindset with a willingness to question assumptions and conventional wisdom</li>\n</ul>\n</div><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692027416,
    "expiryDate": 1697211415,
    "applicationLink": "https://himalayas.app/companies/stripe/jobs/data-scientist-liquidity-management-8605952773",
    "guid": "https://himalayas.app/companies/stripe/jobs/data-scientist-liquidity-management-8605952773"
  },
  {
    "title": "Senior Account Executive, Social Impact",
    "excerpt": "See yourself at TwilioJoin the team as our next Senior Account Executive, Social Impact!",
    "image": "https://og-images-v2.himalayas.app/api/company?text=Remote%20Senior%20Account%20Executive%2C%20Social%20Impact%20at%20Twilio&companyLogo=https://cdn-images.himalayas.app/540gx6w3jpqpbhcthgz9624mrm98&buttonText=Apply%20now&category=Senior%20Account%20Executive&skills=Strategic%20Sales%2CRelationship%20Management%2CData%20Analytics%2CForecasting%2CCommunication%2CTwilio&companyUrl=twilio.com&countryString=United%20States%20only&countryCodes=US",
    "companyName": "Twilio",
    "companyLogo": "https://cdn-images.himalayas.app/540gx6w3jpqpbhcthgz9624mrm98",
    "minSalary": null,
    "maxSalary": null,
    "seniority": ["Senior", "Executive"],
    "locationRestrictions": ["United States"],
    "timezoneRestrictions": [-10, -9, -8, -7, -6, -5, 14],
    "categories": [
      "Senior-Account-Executive",
      "Strategic-Account-Executive",
      "Senior-Enterprise-Account-Executive",
      "Strategic-Enterprise-Account-Executive",
      "Sales-Account-Executive",
      "Strategic-Account-Manager",
      "Major-Account-Executive",
      "Account-Executive-Manager",
      "Sales"
    ],
    "parentCategories": [],
    "description": "<h3>See yourself at <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>\n</h3><p>Join the team as our next Senior Account Executive, Social Impact!</p><h3>Who we are  why we’re hiring</h3><p><a href=\"https://himalayas.app/companies/twilio\">Twilio</a> powers real-time business communications and data solutions that help <a href=\"https://customers.twilio.com/\">companies and developers worldwide</a> build better applications and customer experiences.</p><p>Although we're headquartered in San Francisco, we have presence throughout South America, Europe, Asia and Australia. We're on a journey to becoming a globally anti-racist, anti-oppressive, anti-bias company that actively opposes racism and all forms of oppression and bias. At <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>, we support <a href=\"https://www.twilio.com/company/diversity\">diversity, equity  inclusion</a> wherever we do business. We employ thousands of <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>ns worldwide, and we're looking for more builders, creators, and visionaries to help fuel our growth momentum.</p><h3>About the job</h3><p>As a Senior Account Executive at <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>.org, you will lead social impact strategic relationships with influential nonprofits and social enterprises, who utilize <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>’s messaging, voice, and email services to drive social impact. You will play a vital role in acquiring and growing <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>.org’s customer base by executing on the overall customer acquisition and growth strategy. Your ability to create demand, build partnerships, and collaborate across teams will be essential to achieving your goals and contributing to the organization’s mission. This role is highly cross functional, and your success will depend on building deep partnerships across product management, partner alliances, finance, support, and operations.</p><h3>Responsibilities</h3><h3>In this role, you’ll:</h3><ul>\n<li>Manage and expand some of our most important social impact customer accounts, including nonprofits, social enterprises, and government agencies. </li>\n<li>Develop, drive, and execute account strategy to consistently deliver strong revenue, gross margin, and gross profit results.</li>\n<li>Partner closely with other <a href=\"https://himalayas.app/companies/twilio\">Twilio</a> teams and alliance partners to identify new revenue opportunities within your account portfolio.</li>\n<li>Grow pipeline in collaboration with Marketing and Demand Gen Teams as well as individual prospecting in the assigned territory/vertical.  </li>\n<li>Serve on a cross-functional account team with representatives from partner alliances, product, operations, marketing, support, and social and environmental impact team members. </li>\n<li>Run a disciplined forecast, consistently achieve goals, and present guidance to executive management.</li>\n<li>Run highly consultative sales cycles with our customers with a focus on deep discovery, listening to customer needs and being an effective champion for their point of view in the organization.</li>\n<li>Provide support for Social Impact activities through engaging with regional <a href=\"https://himalayas.app/companies/twilio\">Twilio</a> teams in partnership with key <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>.org customers and partners.</li>\n</ul><h3>Qualifications </h3><p>Not all applicants will have skills that match a job description exactly. <a href=\"https://himalayas.app/companies/twilio\">Twilio</a> values diverse experiences in other industries, and we encourage everyone who meets the required qualifications to apply. While having “desired” qualifications make for a strong candidate, we encourage applicants with alternative experiences to also apply. If your career is just starting or hasn't followed a traditional path, don't let that stop you from considering <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>. We are always looking for people who will bring something new to the table!</p><h3>Required:</h3><ul>\n<li>7-10+ years of combined experience in major account or strategic sales, managing or leading quantitative, highly analytical products and solutions for customers. </li>\n<li>Accountable for relationship management, cross sells, upsells and solutions consulting.</li>\n<li>Comfortable working with nonprofits and highly technical leaders, while influencing their understanding and building supportive partnerships.</li>\n<li>Analytical account development strategy based on using data to find opportunities and prove value.</li>\n<li>Demonstrated track record of managing business forecasts and financial models. </li>\n<li>Entrepreneurial mindset with appetite to define processes and build programs.</li>\n<li>Record of delivering revenue and gross profit results, especially for nonprofits and social enterprise customers.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Bachelor’s Degree or equivalent years of experience.</li>\n</ul><h3>Desired:</h3><ul>\n<li>Deep experience working with telecom companies, including SMS aggregators, carriers, or global communications platforms.</li>\n<li>Domain expertise from collaborating with nonprofits and social enterprises encompasses areas such as donor optimization, mission communication, volunteer recruitment, and program promotion with a focus on impact measurement.  </li>\n<li>Software, SaaS, CPaas or PaaS selling experience.</li>\n</ul><h3>Location </h3><ul>\n<li>This role will be remote, and based in the United States. </li>\n<li>Approximately 15% travel is anticipated. </li>\n</ul><h3>What We Offer</h3><p>There are many benefits to working at <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>, including, in addition to competitive pay, things like generous time-off, ample parental and wellness leave, healthcare, a retirement savings program, and much more. Offerings vary by location.</p><h3>\n<a href=\"https://himalayas.app/companies/twilio\">Twilio</a> thinks big. Do you?</h3><p>We like to solve problems, take initiative, pitch in when needed, and are always up for trying new things. That's why we seek out colleagues who embody our values — something we call<a href=\"https://www.twilio.com/company/values\"> </a><a href=\"https://himalayas.app/companies/twilio\">Twilio</a> Magic. Additionally, we empower employees to build<a href=\"https://www.twilio.org/impact-fund/\"> positive change in their communities</a> by supporting their volunteering and donation efforts.</p><p>So, if you're ready to unleash your full potential, do your best work, and be the best version of yourself, apply now!</p><p>If this role isn't what you're looking for, <a href=\"https://www.twilio.com/company/jobs#open-positions\">please consider other open positions</a>.</p><p><strong><em>*Please note this role is open to candidates outside of Colorado, California, New York, and Washington. The information below is provided for candidates hired in those locations only.</em></strong></p><p>The estimated pay ranges for this role are as follows:</p><ul>\n<li>Based in Colorado: $146,200.00 - $182,700.00. </li>\n<li>Based in New York, Washington State, or the San Francisco Bay area, California: $162,400.00 - $203,000.00.</li>\n<li>This role may be eligible to participate in <a href=\"https://himalayas.app/companies/twilio\">Twilio</a>’s equity plan. All roles are eligible for the following benefits: health care insurance, 401(k) retirement account, paid sick time, paid personal time off, paid parental leave.</li>\n<li>This role is eligible to earn commissions. </li>\n</ul><p>The successful candidate’s starting salary will be determined based on permissible, non-discriminatory factors such as skills, experience, and geographic location within the state.</p><div class=\"content-conclusion\"><div><div><div><div><div>\n<p><strong><a href=\"https://himalayas.app/companies/twilio\">Twilio</a> is proud to be an equal opportunity employer. </strong><a href=\"https://himalayas.app/companies/twilio\">Twilio</a> is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Additionally, <a href=\"https://himalayas.app/companies/twilio\">Twilio</a> participates in the E-Verify program in certain locations, as required by law.</p>\n<p><a href=\"https://himalayas.app/companies/twilio\">Twilio</a> is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please contact us at <a href=\"mailto:accommodation@twilio.com\">accommodation@twilio.com</a>.</p>\n</div></div></div></div></div></div><p>Originally posted on <a href='https://himalayas.app'>Himalayas</a></p>",
    "pubDate": 1692027072,
    "expiryDate": 1697211072,
    "applicationLink": "https://himalayas.app/companies/twilio/jobs/senior-account-executive-social-impact-1393147901",
    "guid": "https://himalayas.app/companies/twilio/jobs/senior-account-executive-social-impact-1393147901"
  }
]
